{
  "Header.Item1": "About me",
  "Header.Item2": "Experience",
  "Header.Item3": "Projects",
  "Header.Item4": "Contact",
  "Header.cvBtn": "Resume",
  "Header.cvName": "Zulkifal's_CV.pdf",
  "Banner.Pretitle": "Hello! My name is",
  "Banner.Description": "I have <span class='underline'>2+ years of experience</span> developing systems, interfaces, bots, and technological solutions to make the web a better place. I am dedicated to writing and refactoring clean, reusable, and scalable code in <span class='underline'>Angular JS, NodeJS</span> and sometimes in <span class='underline'>Python</span> applying good practices and development standards.",
  "Banner.ActionBtn": "Get in touch",
  "AboutMe.Title": "About me",
  "AboutMe.Paragraphs": [
    "In my <span class='underline'>2+ years as a developer</span>, I sought to train every day. I have worked on <span class='underline'>Micro Frontend Technologies, Angular Custom Libraries</span>,  writing <span class='underline'>unit tests</span>, <span class='underline'>performing continuous integration</span>, and covered backend developer roles with <span class='underline'>ExpressJS, NestJs, MongoDB and MySQL</span>. I have led teams having empathy, motivating to partners, and collaboratively setting plans and goals together.",
    "My skills also include implementing system improvements, optimizing sites, standardizing patterns, and suggesting and executing ideas that add value to the project I'm working on.",
    "Some of the technologies that I have trained and worked on include (but are not limited to):"
  ],
  "Experience.Title": "Experience",
  "Experience.Jobs": [
    {
      "Tab": "SMSAMI",
      "Title": "Frontend Engineer",
      "Date": "June 2023 - Present",
      "Description": [
        "Developed and maintained a web-based application using Angular, Node.js, and MongoDB, resulting in improved user experience and increased performance.",
        "Designed and implemented multiple Plugin's to support multiple applications, using Angular Libraries.",
        "Implementation of continuous integration and daily backups.",
        "Worked in team of 4 people in the development of a E-Retail Cloud based solution, Flyaway Hub.",
        "Used Git, AWS Codecommit for Version Controlling.",
        "Planning meetings in reports."
      ]
    },

    {
      "Tab": "Welltime Ltd",
      "Title": "Angular developer",
      "Date": "May 2021 - June 2022",
      "Description": [
        "Developed and maintained web applications using Angular.",
        "Coding of API requests with RxJS using HTTP modules.",
        "Creation of modules with complex reactive forms",
        "Improved website performance by optimizing images and implementing caching techniques.",
        "Collaborated with designers and back-end developers to create responsive and user-friendly web experiences",
        "Lead a team of 4 Angular Interns, providing them with training and support."
      ]
    },
    {
      "Tab": "Freelancer",
      "Title": "Independent",
      "Date": "March 2020 - Present",
      "Description": [
        "Implementing continuous improvements, working on frontend and backend.",
        "Creating platforms with Angular, Nodejs,reactive, and object-oriented programming paradigms.",
        "Automation of processes with data structures.",
        "Design layout with SASS, Bootstrap, Materialize, Prime Faces, etc."
      ]
    }
  ],
  "FeatureProjects.Title": "Projects that I was a part of",
  "FeatureProjects.Label": "Featured Project",
  "FeatureProjects.Projects": [
    {
      "Title": "E-Retail Point",
      "Description": "A Next Generation Cloud based E-Retail System application made from scratch with <span class='underline'>Micro Frontend Technologie's</span>, <span class='underline'>role based setting's</span> and <span class='underline'>user management</span>.",
      "imgs": [
        "assets/images/school/image1.1.png",
        "assets/images/school/image1.2.png",
        "assets/images/school/image1.3.png",
        "assets/images/school/image1.4.png"
      ],
      "Technologies": [
        "Angular",
        "Angular Custom Librarie's",
        "Angular Material",
        "NgRx"
      ]
    },
    {
      "Title": "Flyaway Hub",
      "Description": "Flyaway Hub is a cloud-based management information system (MIS). Flexibly designed according to the demanding needs of the <span class='underline'> Aviation Industry </span>. Letting you easily manage your resources and schedule in a secure environment.",
      "imgs": [
        "assets/images/bbm/image1.1.png",
        "assets/images/bbm/image1.2.png",
        "assets/images/bbm/image1.3.png",
        "assets/images/bbm/image1.4.png"
      ],
      "Technologies": [
        "Angular",
        "Angular Custom Librarie's",
        "Angular Material",
        "NgRx"
      ]
    },
    {
      "Title": " IntelligentForms",
      "Description": " IntelligentForms is for the <span class='underline'> Dental Practices </span> accross UK that are future-oriented, brand conscious, customer-focused, providing effective clinical processes, and aligned with staff’s happiness, IntelligentForms Pro is the best solution.",
      "imgs": [
        "assets/images/mazhr/image1.1.png",
        "assets/images/mazhr/image1.2.png",
        "assets/images/mazhr/image1.3.png",
        "assets/images/mazhr/image1.4.png"
      ],
      "Technologies": ["Angular", "ChartJS", "Angular Material", "RxJs"]
    },
    {
      "Title": "Three Oaks Behavioral Health & Wellness",
      "Description": "Three Oaks is a team of deeply passionate, highly skilled, and intensively trained providers that believe therapy is a process of growth & self-discovery, thus making the experience uniquely yours.",
      "imgs": [
        "assets/images/mazhr/image1.1.1.png",
        "assets/images/mazhr/image1.2.2.png",
        "assets/images/mazhr/image1.3.3.png",
        "assets/images/mazhr/image1.4.4.png"
      ],

      "Technologies": ["Angular", "Bootstrap", "CSS"]
    }
  ],
  "OtherProjects.Title": "More personal projects",
  "OtherProjects.Projects": [
    {
      "Title": "Covid Tracker",
      "Description": "Covid Tracker is a web app which is built using the 3rd Party Api integration. This app shows the records from worldwise and countrywise that shows the who much patient are suffer from covid who many died from covid and how many are recoverd from covid",

      "Technologies": ["Angular", "ChartJs", "API", "Bootstrap"]
    },
    {
      "Title": "Quiz App",
      "Description": "A single page quiz app that has a minimal design, that has different level to attempt quizes.",

      "Technologies": ["Angular", "Bootstrap", "3rd Party Library"]
    },
    {
      "Title": "JWT Integration",
      "Description": "JWT authentication in Node Js with MsSQL",

      "Technologies": ["Angular", "JWT", "ExpressJS"]
    }
  ],
  "Contact.Pretitle": "What’s Next",
  "Contact.Title": "Get in touch!",
  "Contact.Content": "I will be happy to receive your contact if you want to talk about new opportunities. Write me, and I will reply as soon as I see your message. Simple one-page design that features a profile letter with basic information about a person.",
  "Contact.Btn": "Say Hello"
}
